app/controllers/game_controller.rb

SELECT * FROM "states" WHERE ("states"."user_id" = '3344222255') LIMIT 1
INSERT INTO "states" ("name", "current_enthusiasm", "location_id", "job", "user_id", "hood_id", "option_id", "created_at") VALUES('ready', 100, 1, NULL, 339378, 1, 1, '2009-03-02 23:17:13')
---
  def create
    #find previous game
    @state = State.find_by_user_id(current_user.id)
    if !@state
      @state = State.new
      @state.user_id = current_user.id
      @state.save

SELECT * FROM "states" WHERE ("states"."user_id" = 339378) LIMIT 1
SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "states" SET "location_id" = 12 WHERE "id" = 1
---
  def move
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if params[:id] then
        @state.change_location!(params[:id])
      end
      @state.save

SELECT * FROM "states" WHERE ("states"."user_id" = 339378) LIMIT 1
SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "states" SET "name" = 'You are visiting', "current_enthusiasm" = 97 WHERE "id" = 22
UPDATE "actors" SET "looks" = 3.012, "updated_at" = '2009-03-02 23:47:59' WHERE "id" = 1
---
  def jog
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm >= 3 then
        @state.lose_enthuse!(3)
        @thisguy.exercise!
        @state.save
        @thisguy.save

SELECT * FROM "states" WHERE ("states"."user_id" = 339378) LIMIT 1
SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "states" SET "current_enthusiasm" = 100 WHERE "id" = 1
UPDATE "actors" SET "burgers" = 1, "updated_at" = '2009-03-03 00:01:30' WHERE "id" = 1
---
  def reset_enthusiasm
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm < 100 then
        @state.reset_enthuse!
        @state.save
        @thisguy.lose_burger!
        @thisguy.save

SELECT * FROM "states" WHERE ("states"."user_id" = 339378) LIMIT 1
---
  def refresh_enthuse
      @state = State.find_by_user_id(current_user.id)

SELECT * FROM "states" WHERE ("states"."user_id" = 339378) LIMIT 1
SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "states" SET "location_id" = 1, "name" = 'Please choose somewhere to visit:', "current_enthusiasm" = 24, "hood_id" = 2 WHERE "id" = 1
SELECT * FROM "hoods" WHERE ("hoods"."id" = 3)
---
  def move_hood
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm >= 10 then
        @state.lose_enthuse!(10)
        if params[:id] then
          @state.change_hood!(params[:id])
          flash[:notice]="You are tired from the journey."
        end
        session[:option_name] = ""
        @state.save
        @thisguy.save
      else
        flash[:notice]="You are too tired to make it to #{Hood.find(params[:id]).name}. Maybe you should eat a burger."

SELECT * FROM "states" WHERE ("states"."user_id" = '3344222255') LIMIT 1
UPDATE "states" SET "name" = 'You are visiting', "current_enthusiasm" = 97 WHERE "id" = 13
SELECT * FROM "options" WHERE ("options"."id" = 13) LIMIT 1
---
  def set_option
      @state = State.find_by_user_id(current_user.id)
      @state.set_option!(params[:id])
      @state.save
      session[:option_name] = Option.find(params[:id]).name

SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "actors" SET "skill" = 7.028, "updated_at" = '2009-03-02 23:48:01' WHERE "id" = 1
---
  def busk
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm >= 3 then
        @state.lose_enthuse!(3)
        @thisguy.learn!
        @state.save
        @thisguy.save

SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "actors" SET "charisma" = 4.016, "updated_at" = '2009-03-03 00:01:23' WHERE "id" = 1
---
  def flirt
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm >= 3 then
        @state.lose_enthuse!(3)
        @thisguy.flirt!
        @state.save
        @thisguy.save

SELECT * FROM "actors" WHERE ("actors"."user_id" = 339378) LIMIT 1
UPDATE "actors" SET "savvy" = 2.028, "updated_at" = '2009-03-02 23:46:49' WHERE "id" = 1
---
  def pavement
      @state = State.find_by_user_id(current_user.id)
      @thisguy=Actor.find_by_user_id(current_user.id)
      if @state.current_enthusiasm >= 5 then
        @state.lose_enthuse!(5)
        @thisguy.pavement!
        @state.save
        @thisguy.save

SELECT * FROM "actors" WHERE ("actors"."user_id" = 1) LIMIT 1
SELECT * FROM "locations" WHERE ("locations".hood_id = 1)
SELECT * FROM "hoods" WHERE ("hoods"."id" = 1) LIMIT 1
---
  def play
    if not current_user then
      redirect_to(:controller => '/home')
    end
    @thisguy=Actor.find_by_user_id(current_user.id)
    if not defined? @thisguy
      redirect_to(:controller => '/actor', :action => 'new')
    end
    session[:option_name] = nil
    #@state_pages, @states = paginate :states, :per_page => 10
    @state = State.find_by_user_id(current_user.id)
    @state.option_id = 999
    @location = Location.find(@state.location_id)
    @hood = Hood.find(@state.hood_id)