app/controllers/page_controller.rb

  def view
    i=(params[:id] or 1)
    @page = Page.find(i)
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1)