app/controllers/score_controller.rb

def board
  @thisguy=Actor.find_by_user_id(current_user)
---
SELECT * FROM "actors" WHERE ("actors"."user_id" = '--- :false