app/controllers/songs_controller.rb

SELECT * FROM "songs" WHERE ("songs"."id" = 591)
---
  def show
    @page_title = "InMusic.org"
    if params[:id].to_i > 0
      @song = Song.find(params[:id])

SELECT * FROM "songs" WHERE ("songs"."id" = 585)
---
  def edit
    @page_title = "InMusic.org"
    @song = Song.find(params[:id])